### Pandas: Python Data Analysis Library

## Installing

Choose one of the following commands:

`conda install pandas`

`pip install pandas`

In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
grades = [8.5, 7, 9]
pd.Series(grades)

0    8.5
1    7.0
2    9.0
dtype: float64

In [3]:
grades = [8.5, 7, 9]
students = ['Student A','Student B','Student C']
pd.Series(grades, students)

Student A    8.5
Student B    7.0
Student C    9.0
dtype: float64

In [4]:
np_grades = np.array([6, 7, 8])
pd.Series(np_grades)

0    6
1    7
2    8
dtype: int64

#### Exercise

(a) Create a series from a Python dictionary;

In [5]:
series_a = pd.Series([5 ,2, 2], ['Brazil','Argentina','France'])
print("Brazil has {} World Cups.".format(series_a['Brazil']))

Brazil has 5 World Cups.

In [6]:
series_a['Brazil', 'Argentina']

KeyError: ('Brazil', 'Argentina')

In [11]:
type(series_a[['Brazil', 'Argentina']])
type(series_a['Brazil'])

numpy.int64

In [9]:
series_b = pd.Series([2018, 2002, 1986],index=['France','Brazil','Argentina'])
print("Last time France won World Cup was in {}, while Brazil won in {} and Argentina in {}".format(series_b['France'],series_b['Brazil'],series_b['Argentina']))

Last time France won World Cup was in 2018, while Brazil won in 2002 and Argentina in 1986

### Operations

In [13]:
series_c = pd.Series(data=[5, 10, 9], index=['AL01', 'AL03', 'AL02'])
series_d = pd.Series(data=[4, 6, 4], index=['AL01', 'AL02', 'AL03'])
sum_c_d = series_c + series_d
sum_c_d

AL01     9
AL02    15
AL03    14
dtype: int64

In [14]:
diff_c_d = series_c - series_d
diff_c_d

AL01    1
AL02    3
AL03    6
dtype: int64

In [15]:
series_e = pd.Series(data=[5, 9, 10, 5], index=['AL01', 'AL02', 'AL03', 'AL04'])
series_f = pd.Series(data=[4, 6, 4], index=['AL01', 'AL02', 'AL03'])
sum_e_f = series_e + series_f
sum_e_f

AL01     9.0
AL02    15.0
AL03    14.0
AL04     NaN
dtype: float64

### Methods - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

In [17]:
series_e

AL01     5
AL02     9
AL03    10
AL04     5
dtype: int64

In [16]:
series_e.max()

10

In [18]:
series_e.min()

5

In [19]:
series_e.describe()

count     4.000000
mean      7.250000
std       2.629956
min       5.000000
25%       5.000000
50%       7.000000
75%       9.250000
max      10.000000
dtype: float64

In [20]:
series_e.cummax()

AL01     5
AL02     9
AL03    10
AL04    10
dtype: int64

In [21]:
series_e.cumprod()

AL01       5
AL02      45
AL03     450
AL04    2250
dtype: int64

In [22]:
series_e.diff()

AL01    NaN
AL02    4.0
AL03    1.0
AL04   -5.0
dtype: float64

## DataFrames

In [23]:
data = np.random.rand(5, 3) * 10
col = ['T1', 'T2', 'T3']
index = ['ST01','ST02','ST03','ST04','ST05']
df = pd.DataFrame(data, index, col)
df

            T1        T2        T3
ST01  8.516677  2.389301  7.781366
ST02  6.423525  9.333686  1.604778
ST03  0.607609  8.247837  1.658695
ST04  5.469924  7.779192  4.109092
ST05  2.110807  8.791925  3.360409

In [24]:
df['T1']

ST01    8.516677
ST02    6.423525
ST03    0.607609
ST04    5.469924
ST05    2.110807
Name: T1, dtype: float64

In [25]:
df.T1 # Not recommended

ST01    8.516677
ST02    6.423525
ST03    0.607609
ST04    5.469924
ST05    2.110807
Name: T1, dtype: float64

In [26]:
type(df['T1'])

pandas.core.series.Series

In [27]:
df[['T1', 'T2']]

            T1        T2
ST01  8.516677  2.389301
ST02  6.423525  9.333686
ST03  0.607609  8.247837
ST04  5.469924  7.779192
ST05  2.110807  8.791925

In [28]:
df['T4'] = np.random.rand(5) * 10
df

            T1        T2        T3        T4
ST01  8.516677  2.389301  7.781366  3.306863
ST02  6.423525  9.333686  1.604778  5.569524
ST03  0.607609  8.247837  1.658695  8.580551
ST04  5.469924  7.779192  4.109092  9.984384
ST05  2.110807  8.791925  3.360409  8.788707

In [29]:
type(df['T4'])

pandas.core.series.Series

In [30]:
df['avg'] = (df['T1'] + df['T2'] + df['T3'] + df['T4'])/4
df

            T1        T2        T3        T4       avg
ST01  8.516677  2.389301  7.781366  3.306863  5.498552
ST02  6.423525  9.333686  1.604778  5.569524  5.732878
ST03  0.607609  8.247837  1.658695  8.580551  4.773673
ST04  5.469924  7.779192  4.109092  9.984384  6.835648
ST05  2.110807  8.791925  3.360409  8.788707  5.762962

In [31]:
df['another_avg'] = df.mean(1)
df

            T1        T2        T3        T4       avg  another_avg
ST01  8.516677  2.389301  7.781366  3.306863  5.498552     5.498552
ST02  6.423525  9.333686  1.604778  5.569524  5.732878     5.732878
ST03  0.607609  8.247837  1.658695  8.580551  4.773673     4.773673
ST04  5.469924  7.779192  4.109092  9.984384  6.835648     6.835648
ST05  2.110807  8.791925  3.360409  8.788707  5.762962     5.762962

In [33]:
df = df.drop(['avg', 'another_avg'], axis=1)
df

            T1        T2        T3        T4
ST01  8.516677  2.389301  7.781366  3.306863
ST02  6.423525  9.333686  1.604778  5.569524
ST03  0.607609  8.247837  1.658695  8.580551
ST04  5.469924  7.779192  4.109092  9.984384
ST05  2.110807  8.791925  3.360409  8.788707

### Working with DataFrames

In [34]:
st02 = df.loc['ST02']
st02

T1    6.423525
T2    9.333686
T3    1.604778
T4    5.569524
Name: ST02, dtype: float64

In [35]:
type(st02)

pandas.core.series.Series

In [36]:
df.iloc[1]

T1    6.423525
T2    9.333686
T3    1.604778
T4    5.569524
Name: ST02, dtype: float64

In [37]:
df.loc['ST02']['T1']

6.423524717482633

In [39]:
df.iloc[1]['T1']

6.423524717482633

In [40]:
df.loc[['ST02', 'ST03']][['T1', 'T2']]

            T1        T2
ST02  6.423525  9.333686
ST03  0.607609  8.247837

In [41]:
df.loc[['ST02', 'ST03']]

            T1        T2        T3        T4
ST02  6.423525  9.333686  1.604778  5.569524
ST03  0.607609  8.247837  1.658695  8.580551

In [42]:
df.iloc[[1, 4]][['T1', 'T2']]

            T1        T2
ST02  6.423525  9.333686
ST05  2.110807  8.791925

In [43]:
df.iloc[[1, 4], [1, 2]]

            T2        T3
ST02  9.333686  1.604778
ST05  8.791925  3.360409

### Conditional selection

In [44]:
df = df.drop(['avg', 'another_avg'], axis=1)

KeyError: "['avg' 'another_avg'] not found in axis"

In [45]:
df[df > 3]

            T1        T2        T3        T4
ST01  8.516677       NaN  7.781366  3.306863
ST02  6.423525  9.333686       NaN  5.569524
ST03       NaN  8.247837       NaN  8.580551
ST04  5.469924  7.779192  4.109092  9.984384
ST05       NaN  8.791925  3.360409  8.788707

In [46]:
mean_T1 = df['T1'].mean()
mean_T1

4.625708270818366

In [47]:
df['T1'] > mean_T1

ST01     True
ST02     True
ST03    False
ST04     True
ST05    False
Name: T1, dtype: bool

In [48]:
df['T1']

ST01    8.516677
ST02    6.423525
ST03    0.607609
ST04    5.469924
ST05    2.110807
Name: T1, dtype: float64

In [49]:
df[df['T1'] > mean_T1]

            T1        T2        T3        T4
ST01  8.516677  2.389301  7.781366  3.306863
ST02  6.423525  9.333686  1.604778  5.569524
ST04  5.469924  7.779192  4.109092  9.984384

In [50]:
df[(df['T1'] > 5) and (df['T2'] > 5)]
df[(df['T1'] > 5) or (df['T2'] > 5)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [51]:
df[(df['T1'] > 2) & (df['T2'] > 2)]

            T1        T2        T3        T4
ST01  8.516677  2.389301  7.781366  3.306863
ST02  6.423525  9.333686  1.604778  5.569524
ST04  5.469924  7.779192  4.109092  9.984384
ST05  2.110807  8.791925  3.360409  8.788707

In [52]:
df[(df['T1'] > 5) | (df['T2'] > 5)]

            T1        T2        T3        T4
ST01  8.516677  2.389301  7.781366  3.306863
ST02  6.423525  9.333686  1.604778  5.569524
ST03  0.607609  8.247837  1.658695  8.580551
ST04  5.469924  7.779192  4.109092  9.984384
ST05  2.110807  8.791925  3.360409  8.788707

###  Reset de Index

In [54]:
df.reset_index(drop=False)
df

            T1        T2        T3        T4
ST01  8.516677  2.389301  7.781366  3.306863
ST02  6.423525  9.333686  1.604778  5.569524
ST03  0.607609  8.247837  1.658695  8.580551
ST04  5.469924  7.779192  4.109092  9.984384
ST05  2.110807  8.791925  3.360409  8.788707

In [55]:
other_students = ['ST06','ST07','ST08','ST09','ST10']
df['STs'] = other_students
df = df.set_index('STs', drop=True)
df

            T1        T2        T3        T4
STs
ST06  8.516677  2.389301  7.781366  3.306863
ST07  6.423525  9.333686  1.604778  5.569524
ST08  0.607609  8.247837  1.658695  8.580551
ST09  5.469924  7.779192  4.109092  9.984384
ST10  2.110807  8.791925  3.360409  8.788707

In [57]:
#
students = ['ST01','ST01','ST01','ST02','ST02','ST02']
tests =['T1','T2','T3','T1','T2','T3']
advanced_index = list(zip(students, tests))
# print(advanced_index)
advanced_index = pd.MultiIndex.from_tuples(advanced_index)

grades = np.random.rand(6, 3)*10

courses = ['C1','C2','C3']

advanced_df = pd.DataFrame(grades, advanced_index, courses)
advanced_df

[('ST01', 'T1'), ('ST01', 'T2'), ('ST01', 'T3'), ('ST02', 'T1'), ('ST02', 'T2'), ('ST02', 'T3')]

               C1        C2        C3
ST01 T1  8.977740  3.173048  7.129334
     T2  2.078920  9.754159  3.890046
     T3  3.123885  9.789572  0.084084
ST02 T1  9.598052  8.448997  7.534719
     T2  8.651592  0.491333  7.304757
     T3  8.726927  4.973522  6.963583

In [58]:
advanced_df.index.names = ['Students','Tests']
advanced_df

                      C1        C2        C3
Students Tests
ST01     T1     8.977740  3.173048  7.129334
         T2     2.078920  9.754159  3.890046
         T3     3.123885  9.789572  0.084084
ST02     T1     9.598052  8.448997  7.534719
         T2     8.651592  0.491333  7.304757
         T3     8.726927  4.973522  6.963583

In [59]:
grades_st_1 = advanced_df.loc['ST01']
grades_st_1

             C1        C2        C3
Tests
T1     8.977740  3.173048  7.129334
T2     2.078920  9.754159  3.890046
T3     3.123885  9.789572  0.084084

In [60]:
type(grades_st_1)

pandas.core.frame.DataFrame

In [62]:
grades_st_1.loc['T1']
type(grades_st_1.loc['T1'])

pandas.core.series.Series

In [63]:
grades_st_1_t_2 = advanced_df.loc['ST01'].loc['T2']
grades_st_1_t_2

C1    2.078920
C2    9.754159
C3    3.890046
Name: T2, dtype: float64

In [64]:
type(grades_st_1_t_2)

pandas.core.series.Series

In [65]:
advanced_df.xs('ST01')

             C1        C2        C3
Tests
T1     8.977740  3.173048  7.129334
T2     2.078920  9.754159  3.890046
T3     3.123885  9.789572  0.084084

In [66]:
advanced_df.xs('T1', level='Tests')

                C1        C2        C3
Students
ST01      8.977740  3.173048  7.129334
ST02      9.598052  8.448997  7.534719

### Data cleaning

In [67]:
dict_a = {'X':[1, np.nan, np.nan],'Y':[2, 4, np.nan],'Z':[3, 4, 4],}
df3 = pd.DataFrame(dict_a)
df3

     X    Y  Z
0  1.0  2.0  3
1  NaN  4.0  4
2  NaN  NaN  4

In [68]:
df3.dropna()

     X    Y  Z
0  1.0  2.0  3

In [69]:
df3.dropna(axis=1)

   Z
0  3
1  4
2  4

In [70]:
df3.dropna(thresh=2)

     X    Y  Z
0  1.0  2.0  3
1  NaN  4.0  4

In [71]:
df3.fillna(3)

     X    Y  Z
0  1.0  2.0  3
1  3.0  4.0  4
2  3.0  3.0  4

In [72]:
df3.fillna(pd.Series({'X':1,'Y':2,'Z':3}))

     X    Y  Z
0  1.0  2.0  3
1  1.0  4.0  4
2  1.0  2.0  4

In [73]:
df3['Y'].fillna(df3['Y'].mean())

0    2.0
1    4.0
2    3.0
Name: Y, dtype: float64

In [74]:
df3.fillna(df3.mean())

     X    Y  Z
0  1.0  2.0  3
1  1.0  4.0  4
2  1.0  3.0  4

### Grouping

In [75]:
dict_b = {'Method':['KNN', 'SVR', 'ANN', 'KNN', 'SVR', 'ANN'],
        'Scenario':['S1', 'S2', 'S1', 'S2', 'S1', 'S2'],
        'Error':[2.1, 2.1, 1.5, 1.7, 1.8, 1.9]}
df4 = pd.DataFrame(dict_b)
df4

  Method Scenario  Error
0    KNN       S1    2.1
1    SVR       S2    2.1
2    ANN       S1    1.5
3    KNN       S2    1.7
4    SVR       S1    1.8
5    ANN       S2    1.9

In [77]:
byScenario = df4.groupby('Scenario')
print(byScenario)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x119604828>

In [78]:
byScenario.mean()

          Error
Scenario
S1          1.8
S2          1.9

In [79]:
byScenario.sum()

          Error
Scenario
S1          5.4
S2          5.7

In [80]:
byScenario.min()

         Method  Error
Scenario
S1          ANN    1.5
S2          ANN    1.7

In [81]:
byScenario.max()

         Method  Error
Scenario
S1          SVR    2.1
S2          SVR    2.1

### Joins

In [82]:
df_j1 = pd.DataFrame({'A':['A0', 'A1', 'A2'],'B':['B0', 'B1', 'B2']}, index=[0, 1, 2])
df_j1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [83]:
df_j2 = pd.DataFrame({'A':['A3', 'A4', 'A5'],'B':['B3', 'B4', 'B5']},index=[3, 4, 5])
df_j2

    A   B
3  A3  B3
4  A4  B4
5  A5  B5

In [84]:
pd.concat([df_j1, df_j2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [85]:
pd.concat([df_j1, df_j2], axis=1)

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4
5  NaN  NaN   A5   B5

In [86]:
left = pd.DataFrame({'country':['01','02','03'],'name':['Brazil','France','Japan']})
right =  pd.DataFrame({'country':['01','02','03'],'continent':['SA','EU','AS']})
df5 = pd.merge(left, right, how='inner', on='country')
df5

  country    name continent
0      01  Brazil        SA
1      02  France        EU
2      03   Japan        AS

In [89]:
left_2 = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K0'],
                     'A':['A00','A10'],
                     'B':['B00','B10']})
right_2 = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K1'],
                     'C':['C00','C11'],
                     'D':['D00','D11']})
print(left_2)
print(right_2)
df6 = pd.merge(left_2, right_2, how='inner', on=['key1','key2'])
df6

  key1 key2    A    B
0   K0   K0  A00  B00
1   K1   K0  A10  B10
  key1 key2    C    D
0   K0   K0  C00  D00
1   K1   K1  C11  D11

  key1 key2    A    B    C    D
0   K0   K0  A00  B00  C00  D00

In [90]:
left_3 = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K0'],
                     'A':['A00','A10'],
                     'B':['B00','B10']})
right_3 = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K1'],
                     'C':['C00','C11'],
                     'D':['D00','D11']})
df7 = pd.merge(left_3, right_3, how='right', on=['key1','key2'])
df7

  key1 key2    A    B    C    D
0   K0   K0  A00  B00  C00  D00
1   K1   K1  NaN  NaN  C11  D11

In [91]:
df8 = pd.merge(left_3, right_3, how='outer', on=['key1','key2'])
df8

  key1 key2    A    B    C    D
0   K0   K0  A00  B00  C00  D00
1   K1   K0  A10  B10  NaN  NaN
2   K1   K1  NaN  NaN  C11  D11

In [94]:
left_4 = pd.DataFrame({'A':['A0', 'A1'], 'B':['B0', 'B1']}, index=['k0', 'k1'])
right_4 = pd.DataFrame({'C':['C0', 'C1'], 'D':['D0', 'D1']}, index=['k0', 'k1'])
print(left_4)
print(right_4)
left_3.join(right_3)

     A   B
k0  A0  B0
k1  A1  B1
     C   D
k0  C0  D0
k1  C1  D1

ValueError: columns overlap but no suffix specified: Index(['key1', 'key2'], dtype='object')

In [95]:
left_4.join(right_4, how='inner')

     A   B   C   D
k0  A0  B0  C0  D0
k1  A1  B1  C1  D1

### Methods - https://pandas.pydata.org/pandas-docs/stable/reference/frame.html

In [96]:
final_df = pd.DataFrame({'A':[1, 2, 3, 4],'B':[222, 555, 244, 222],'C':['ab', 'cd', 'ef', 'gh']})
final_df

   A    B   C
0  1  222  ab
1  2  555  cd
2  3  244  ef
3  4  222  gh

In [97]:
final_df['B'].unique()

array([222, 555, 244])

In [98]:
print(len(final_df['B'].unique()), final_df['B'].nunique())

3 3

In [99]:
print(df7, '\n')
print(len(df7['B'].unique()), df7['B'].nunique())

  key1 key2    A    B    C    D
0   K0   K0  A00  B00  C00  D00
1   K1   K1  NaN  NaN  C11  D11

2 1

In [100]:
final_df['B'].value_counts()

222    2
555    1
244    1
Name: B, dtype: int64

In [101]:
def pot(x,n=2):
    return x**n

In [102]:
final_df['A'].apply(pot)

0     1
1     4
2     9
3    16
Name: A, dtype: int64

In [103]:
final_df['C'].apply(len)

0    2
1    2
2    2
3    2
Name: C, dtype: int64

In [104]:
final_df['A'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: A, dtype: int64

In [105]:
final_df.sort_values('B')

   A    B   C
0  1  222  ab
3  4  222  gh
2  3  244  ef
1  2  555  cd